<a href="https://colab.research.google.com/github/solver-Mart1n/data-science/blob/main/activities/relational_database/sql/intermediate_sql/2_Lab_String_Built_in_Functions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Built-in functions - Aggregate, Scalar, String, Date and Time Functions in SQLite using Jupyter Notebooks

In this lab, you will learn how to create tables and load data in the [SQLite](https://docs.python.org/3/library/sqlite3.html) database service using Jupyter Notebooks. This notebook supports and runs on Google Colab.

<h2> Objectives </h2>

After completing this lab, you will be able to:
* Compose and run sub-queries with multiple tables
* Check query results and view log files

## Database Definition
The database tables used in this lab activity are as follows.

|ID| ANIMAL| QUANTITY| COST| RESCUEDATE|
|---|---|---|---|---|
|1| Cat| 9| 450.09| 5/29/2018|
|2| Dog| 3| 666.66| 6/1/2018|
|3| Dog| 1| 100| 6/4/2018|
|4| Parrot| 2| 50| 6/4/2018|
|5| Dog| 1| 75.75| 6/10/2018|
|6| Hamster| 6| 60.6| 6/11/2018|
|7| Cat| 1| 44.44| 6/11/2018|
|8| Goldfish| 24| 48.48| 6/14/2018|
|9| Dog| 2| 222.22| 6/15/2018|

## Exercise 1: Create and populate a table using SQL commands

### Build the database structure

In [1]:
import pandas as pd
import sqlite3
from sqlite3 import OperationalError

conn = sqlite3.connect('pet.db', timeout=30)
c = conn.cursor()

In [2]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.10/dist-packages (2.0.29)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (3.0.3)

In [3]:
%reload_ext sql

In [4]:
%sql sqlite:///pet.db

The following setup follows a

DROP (IF EXISTS) -> CREATE -> INSERT

sequence. Afterward, check tables using SQL SELECT queries.

In [5]:
%%sql
drop table if exists PETRESCUE;
-- Create the PETRESCUE table
create table PETRESCUE (
	ID INTEGER NOT NULL,
	ANIMAL VARCHAR(20),
	QUANTITY INTEGER,
	COST DECIMAL(6,2),
	RESCUEDATE DATE,
	PRIMARY KEY (ID)
	);
-- Insert sample data into PETRESCUE table
insert into PETRESCUE values
	(1,'Cat',9,450.09,'2018-05-29'),
	(2,'Dog',3,666.66,'2018-06-01'),
	(3,'Dog',1,100.00,'2018-06-04'),
	(4,'Parrot',2,50.00,'2018-06-04'),
	(5,'Dog',1,75.75,'2018-06-10'),
	(6,'Hamster',6,60.60,'2018-06-11'),
	(7,'Cat',1,44.44,'2018-06-11'),
	(8,'Goldfish',24,48.48,'2018-06-14'),
	(9,'Dog',2,222.22,'2018-06-15')

;

SELECT *
FROM PETRESCUE;

 * sqlite:///pet.db
Done.
Done.
9 rows affected.
Done.

[(1, 'Cat', 9, 450.09, '2018-05-29'),
 (2, 'Dog', 3, 666.66, '2018-06-01'),
 (3, 'Dog', 1, 100, '2018-06-04'),
 (4, 'Parrot', 2, 50, '2018-06-04'),
 (5, 'Dog', 1, 75.75, '2018-06-10'),
 (6, 'Hamster', 6, 60.6, '2018-06-11'),
 (7, 'Cat', 1, 44.44, '2018-06-11'),
 (8, 'Goldfish', 24, 48.48, '2018-06-14'),
 (9, 'Dog', 2, 222.22, '2018-06-15')]

# Aggregate, Scalar, String, Date and Time Functions

## Exercise 2: Aggregate Functions

Query A1:

Enter a function that calculates the total cost of all animal rescues in the PETRESCUE table.

In [6]:
%%sql
SELECT SUM(COST)
FROM PETRESCUE;

 * sqlite:///pet.db
Done.

[(1718.24,)]

Query A2:

Enter a function that displays the total cost of all animal rescues in the PETRESCUE table in a column called
SUM_OF_COST.

In [7]:
%%sql
SELECT SUM(COST) AS SUM_OF_COST
FROM PETRESCUE;

 * sqlite:///pet.db
Done.

[(1718.24,)]

Query A3:

Enter a function that displays the maximum quantity of animals rescued.

In [8]:
%%sql
SELECT MAX(QUANTITY)
FROM PETRESCUE;

 * sqlite:///pet.db
Done.

[(24,)]

Query A4:

Enter a function that displays the average cost of animals rescued.

In [9]:
%%sql
SELECT AVG(COST)
FROM PETRESCUE;

 * sqlite:///pet.db
Done.

[(190.91555555555556,)]

Query A5:

Enter a function that displays the average cost of rescuing a dog.

In [10]:
%%sql
SELECT AVG(COST)
FROM PETRESCUE
WHERE ANIMAL = 'Dog';

 * sqlite:///pet.db
Done.

[(266.15749999999997,)]

## Exercise 3: Scalar and String Functions

Query B1:

Enter a function that displays the rounded cost of each rescue.

In [11]:
%%sql
SELECT CAST(ROUND(COST, 0) AS INTEGER)
FROM PETRESCUE;

 * sqlite:///pet.db
Done.

[(450,), (667,), (100,), (50,), (76,), (61,), (44,), (48,), (222,)]

Query B2:

Enter a function that displays the length of each animal name.

In [12]:
%%sql
SELECT LENGTH(ANIMAL)
FROM PETRESCUE;

 * sqlite:///pet.db
Done.

[(3,), (3,), (3,), (6,), (3,), (7,), (3,), (8,), (3,)]

Query B3:

Enter a function that displays the animal name in each rescue in uppercase.

In [13]:
%%sql
SELECT UPPER(ANIMAL)
FROM PETRESCUE;

 * sqlite:///pet.db
Done.

[('CAT',),
 ('DOG',),
 ('DOG',),
 ('PARROT',),
 ('DOG',),
 ('HAMSTER',),
 ('CAT',),
 ('GOLDFISH',),
 ('DOG',)]

Query B4:

Enter a function that displays the animal name in each rescue in uppercase without duplications.

In [14]:
%%sql
SELECT DISTINCT UPPER(ANIMAL)
FROM PETRESCUE;

 * sqlite:///pet.db
Done.

[('CAT',), ('DOG',), ('PARROT',), ('HAMSTER',), ('GOLDFISH',)]

Query B5:

Enter a query that displays all the columns from the PETRESCUE table, where the animal(s) rescued are cats.
Use cat in lower case in the query.

In [15]:
%%sql
SELECT *
FROM PETRESCUE
WHERE ANIMAL = 'cat'
COLLATE NOCASE;

 * sqlite:///pet.db
Done.

[(1, 'Cat', 9, 450.09, '2018-05-29'), (7, 'Cat', 1, 44.44, '2018-06-11')]

## Exercise 4: Date and Time Functions

Query C1:

Enter a function that displays the day of the month when cats have been rescued.

In [16]:
%%sql
SELECT strftime('%d', RESCUEDATE)
FROM PETRESCUE
WHERE ANIMAL='Cat';

 * sqlite:///pet.db
Done.

[('29',), ('11',)]

Query C2:

Enter a function that displays the number of rescues on the 5th month.

In [17]:
%%sql
SELECT SUM(QUANTITY)
FROM PETRESCUE
WHERE strftime('%m', RESCUEDATE)='05';

 * sqlite:///pet.db
Done.

[(9,)]

Query C3:

Enter a function that displays the number of rescues on the 14th day of the month.

In [18]:
%%sql
SELECT SUM(QUANTITY)
FROM PETRESCUE
WHERE strftime('%d', RESCUEDATE)='14';

 * sqlite:///pet.db
Done.

[(24,)]

Query C4:

Animals rescued should see the vet within three days of arrivals. Enter a function that displays the third day from
each rescue

In [19]:
%%sql
SELECT DATE(RESCUEDATE,'+3 days')
FROM PETRESCUE;

 * sqlite:///pet.db
Done.

[('2018-06-01',),
 ('2018-06-04',),
 ('2018-06-07',),
 ('2018-06-07',),
 ('2018-06-13',),
 ('2018-06-14',),
 ('2018-06-14',),
 ('2018-06-17',),
 ('2018-06-18',)]

Query C5:

Enter a function that displays the length of time the animals have been rescued; the difference between todays
date and the rescue date.

In [20]:
%%sql
SELECT CAST(julianday('NOW') - julianday(RESCUEDATE) AS INTEGER) AS DAYS
FROM PETRESCUE;

 * sqlite:///pet.db
Done.

[(2172,),
 (2169,),
 (2166,),
 (2166,),
 (2160,),
 (2159,),
 (2159,),
 (2156,),
 (2155,)]

## Conclusion

Congratulations! You can now compose and run queries, check results and view the logs. You will use these skills in later labs.

## Credit to the Source Content
This python notebook uses the content of **Hands-on Lab: Built-in functions - Aggregate, Scalar, String, Date and Time Functions** by IBM Skills Network from the [Databases and SQL for Data Science with Python](https://www.coursera.org/learn/sql-data-science) course. The source content uses the MySQL phpMyAdmin GUI tool for all SQL server interactions instead of SQLite and Jupyter Notebooks running on Google Colab.

### Change Log
All versions prior to 1.4, are attributable to IBM Skills Network's version of the **Hands-on Lab: Built-in functions - Aggregate, Scalar, String, Date and Time Functions** written for MySQL phpMyAdmin server GUI tool.


| Date (YYYY-MM-DD) | Version | Changed By    | Change Description        |
| ----------------- | ------- | ------------- | ------------------------- |
|2024-05-09|1.5|Martin Borja|Ported to Jupyter/Python Notebooks; Restructured, and added solutions and comments to help capture concepts |
|2021-07-15| 1.4 |Malika Added |hint to A5 solution|
|2020-06-29| 1.3 |Rose Malcolm |Added new Ex.1 to create table form sql file. Renumbered remaining exercises and solutions.|
|2020-06-26| 1.2 |Steve Hord| Replace quotes |
|2020-06-25| 1.1 |Steve Hord |Revise Objectives section|
|05-Jun-20| 1.0 |Rose Malcolm |Initial version created|

<br>

<hr>

### <h4 align="center"> **Hands-on Lab: Built-in functions - Aggregate, Scalar, String, Date and Time Functions** © IBM Corporation 2023. All rights reserved. </h4>
### <h4 align="center"> **Built-in functions - Aggregate, Scalar, String, Date and Time Functions in SQL using Jupyter Notebooks** © Martin John Hilario Borja 2024. All rights reserved. </h4>

<p>